
&Вместо("ЗаписатьДанныеКонтрагента")
Процедура БА_ПА_ЗаписатьДанныеКонтрагента(Параметры)
	КолЦиклов=Параметры.КолЦиклов;
	пЕДРПОУ=Параметры.ЕДРПОУ;
	Конфигурация=Параметры.Конфигурация;
	Токен=Параметры.Токен;
	
	Если КолЦиклов >18 тогда
		КолЦиклов = 0;
	КонецЕсли;
	
	headers = new Map;
	headers.Insert("Accept-Language", "ru");
	headers.Insert("Accept-Charset","utf-8");
	headers.Insert("Content-Language", "ru");
	headers.Insert("Content-Charset", "utf-8");
	headers.Insert("Content-type", "application/x-www-form-urlencoded; charset=utf-8");
	headers.Insert("Authorization", "Bearer "+Токен);

	queryParams = new Map;
	queryParams.Insert("source","1c");
	
	host = "pactumsys.com";
	url = "/api/v1/cba2911c-01f9-4ca7-833a-46fb0cc079f2/contractors/"+пЕДРПОУ;
	
	response = sabataexWebApi.HTTPSGet(host,,url,queryParams,headers);
	ТекстОтвета = response.GetBodyAsString();
	
	Сообщить(ТекстОтвета);
	ЧтениеJSON = Новый ЧтениеJSON; 
	ЧтениеJSON.УстановитьСтроку( ТекстОтвета);
	Контрагент = ПрочитатьJSON (ЧтениеJSON);
	
	Если Контрагент.Свойство("Status") Тогда	//Все ОК
		пСтатус1=""; пСтатус2=""; пСтатус3="";
		Для Каждого ст Из Контрагент.RegisterStates Цикл
			Если ст.RegisterId = 1 Тогда	//ЕДР
				пСтатус1 = ст.Status;
			ИначеЕсли ст.RegisterId = 2 Тогда	//ЕН
				пСтатус2 = ст.Status;
			ИначеЕсли ст.RegisterId = 3 Тогда	//НДС
				пСтатус3 = ст.Status;
			КонецЕсли;
		КонецЦикла;
		//Если Контрагент.Status ="Done" и (Контрагент.RegisterStates.Количество() >= 3) тогда
		Если пСтатус1="Done" И пСтатус2="Done" И пСтатус3="Done" Тогда
			ЗаполнитьКонтрагента(Контрагент, Параметры);
			Пактум_ЗавершениеПоиска(Параметры);
			КолЦиклов=0;
		ИначеЕсли КолЦиклов < 18  тогда
			Sleep(10);
			Параметры.КолЦиклов =КолЦиклов+1;
			ПолучитьКарточкуКонтрагента(Параметры);
		Иначе
			СтатусЕДР=пСтатус1;	//ЕДР должен ответить...
			Если СтатусЕДР = "Done" Тогда
				ЗаполнитьКонтрагента(Контрагент, Параметры);
			КонецЕсли;
			
			КодОшибки=0;
			ТекстОшибки="";
			Для Каждого ст Из Контрагент.RegisterStates Цикл
				Если ст.Status ="Done" Тогда
					Продолжить;
				КонецЕсли;
				Если ст.RegisterId = 1 Тогда		//ЕДР
					КонтрагентСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоЕДРПОУ", пЕДРПОУ);
					Если КонтрагентСсылка = Справочники.Контрагенты.ПустаяСсылка() Тогда
						КодОшибки=4;
					Иначе
						КодОшибки=5;
					КонецЕсли;
				ИначеЕсли ст.RegisterId = 2 Тогда	//ЕН
					Если КодОшибки=0 Тогда
						КодОшибки=1;
					Иначе
						Если КодОшибки<4 Тогда
							КодОшибки=3;
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли ст.RegisterId = 3 Тогда	//НДС
					Если КодОшибки=0 Тогда
						КодОшибки=2;
					Иначе
						Если КодОшибки<4 Тогда
							КодОшибки=3;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если КодОшибки=0 Тогда
				КонтрагентСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоЕДРПОУ", пЕДРПОУ);
				Если КонтрагентСсылка = Справочники.Контрагенты.ПустаяСсылка() Тогда
					КодОшибки=4;
				Иначе
					КодОшибки=5;
				КонецЕсли;
			КонецЕсли;
			ТекстОшибки=ПолучитьТекстОшибкиРеестров(КодОшибки);
			Пактум_ЗавершениеПоиска(Параметры, Истина, ТекстОшибки);
			КолЦиклов = 0;
		КонецЕсли;
	Иначе
		Пактум_ЗавершениеПоиска(Параметры, Истина, Контрагент.Message);
		КолЦиклов = 0;
	КонецЕсли;
	Параметры.Вставить("КолЦиклов", КолЦиклов);

КонецПроцедуры
